"""
연습 문제 4.

16진수 문자로 이루어진 1차원 배열이 주어질 때 앞에서부터 7bit씩 묶어 십진수로 변환하여 출력하기

입력 예시)
0F97A3

출력 예시)
7 101 116 3

참고 사항) 16진수 & 2진수
1. 0xff -> 255
    15      15
 1 1 1 1  1 1 1 1

2. 0xfa -> 250
    15      10
 1 1 1 1  1 0 1 0

3. 0xfe -> 254
   15       14
 1 1 1 1  1 1 1 0
"""

# 16진수 -> 2진수
asc = [[0, 0, 0, 0],  #2진법 - 0(16진법)
       [0, 0, 0, 1],  #2진법 - 1(16진법)
       [0, 0, 1, 0],  #2진법 - 2(16진법)
       [0, 0, 1, 1],  #2진법 - 3(16진법)
       [0, 1, 0, 0],  #2진법 - 4(16진법)
       [0, 1, 0, 1],  #2진법 - 5(16진법)
       [0, 1, 1, 0],  #2진법 - 6(16진법)
       [0, 1, 1, 1],  #2진법 - 7(16진법)
       [1, 0, 0, 0],  #2진법 - 8(16진법)
       [1, 0, 0, 1],  #2진법 - 9(16진법)
       [1, 0, 1, 0],  #2진법 - A(16진법) - 10
       [1, 0, 1, 1],  #2진법 - B(16진법) - 11
       [1, 1, 0, 0],  #2진법 - C(16진법) - 12
       [1, 1, 0, 1],  #2진법 - D(16진법) - 13
       [1, 1, 1, 0],  #2진법 - E(16진법) - 14
       [1, 1, 1, 1]]  #2진법 - F(16진법) - 15

#1. 문자 -> 16진수
def ascii_to_hex(c):
    # 9이하인 경우 16진수 변환
    if c <= '9':
        return ord(c) - ord('0')
    # 10이상인 경우 16진수 변환
    else:
        return ord(c) - ord('A') + 10

#2. 16진수 -> 2진수
def hex_to_binary(x):
    for i in range(4):
        t.append(asc[x][i])

t = []
arr = '0F97A3'
for i in range(len(arr)):
    hex_to_binary(ascii_to_hex(arr[i]))

print(t)
#3. 7bit씩 묶어서 2진수 -> 10진수 변환
"""
print(t)
[0, 0, 0, 0, 1, 1, 1, 1, 1, 0, 0, 1, 0, 1, 1, 1, 1, 0, 1, 0, 0, 0, 1, 1]

앞에서부터 7 bit씩 끊고 10진수 변환

1. 0, 0, 0, 0, 1, 1, 1 -> 7
2. 1, 1, 0, 0, 1, 0, 1 -> 101
3. 1, 1, 1, 0, 1, 0, 0 -> 116
4. 0, 1, 1 -> 3
"""
n = 0
for i in range(len(t)):
    # 7bit씩 묶어서 십진수 변환
    n = n * 2 + t[i]
    # 7bit를 다 묶었다면
    if i % 7 == 6:
        print(n, end=' ')
        n = 0

if i % 7 != 6:
    print(n)